knieriem/tinygo-stm32-svd/svd/stm32n655.svd
        <register>
          <name>AHB5FZ1</name>
          <displayName>AHB5FZ1</displayName>
          <description>DBGMCU AHB5 peripheral freeze register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DBG_HPDMA1_CH0_STOP</name>
              <description>HPDMA3_CHn suspend in debug</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_HPDMA1_CH1_STOP</name>
              <description>HPDMA3_CHn suspend in debug</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_HPDMA1_CH2_STOP</name>
              <description>HPDMA3_CHn suspend in debug</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_HPDMA1_CH3_STOP</name>
              <description>HPDMA3_CHn suspend in debug</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_HPDMA1_CH4_STOP</name>
              <description>HPDMA3_CHn suspend in debug</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_HPDMA1_CH5_STOP</name>
              <description>HPDMA3_CHn suspend in debug</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_HPDMA1_CH6_STOP</name>
              <description>HPDMA3_CHn suspend in debug</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_HPDMA1_CH7_STOP</name>
              <description>HPDMA3_CHn suspend in debug</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_HPDMA1_CH8_STOP</name>
              <description>HPDMA3_CHn suspend in debug</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_HPDMA1_CH9_STOP</name>
              <description>HPDMA3_CHn suspend in debug</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_HPDMA1_CH10_STOP</name>
              <description>HPDMA3_CHn suspend in debug</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_HPDMA1_CH11_STOP</name>
              <description>HPDMA3_CHn suspend in debug</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_HPDMA1_CH12_STOP</name>
              <description>HPDMA3_CHn suspend in debug</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_HPDMA1_CH13_STOP</name>
              <description>HPDMA3_CHn suspend in debug</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_HPDMA1_CH14_STOP</name>
              <description>HPDMA3_CHn suspend in debug</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_HPDMA1_CH15_STOP</name>
              <description>HPDMA3_CHn suspend in debug</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NPU_DBG_FREEZE</name>
              <description>NPU stop in debug mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <displayName>SR</displayName>
          <description>DBGMCU status register</description>
          <addressOffset>0xFC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00010003</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AP0_PRESENT</name>
              <description>Access point 0 presence</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AP1_PRESENT</name>
              <description>Access point 1 presence</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AP0_ENABLE</name>
              <description>Access point 0 enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AP1_ENABLE</name>
              <description>Access point 1 enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBG_AUTH_HOST</name>
          <displayName>DBG_AUTH_HOST</displayName>
          <description>DBGMCU host authentication register</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MESSAGE</name>
              <description>Mailbox between debugger and processor</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBG_AUTH_DEV</name>
          <displayName>DBG_AUTH_DEV</displayName>
          <description>DBGMCU device authentication register</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MESSAGE</name>
              <description>Mailbox between debugger and processor</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBG_AUTH_ACK</name>
          <displayName>DBG_AUTH_ACK</displayName>
          <description>DBGMCU message read acknowledge authentication register</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HOST_ACK</name>
              <description>Access status to DBG_AUTH_HOST register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DEVICE_ACK</name>
              <description>Access status to DBG_AUTH_DEV register</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
