knieriem/tinygo-stm32-svd/svd/stm32n655.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="DCMI">
      <name>DCMI_S</name>
      <baseAddress>0x58028400</baseAddress>
    </peripheral>
    <peripheral>
      <name>DCMIPP</name>
      <description>Digital camera interface pixel pipeline</description>
      <groupName>DCMIPP</groupName>
      <baseAddress>0x48002000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DCMIPP</name>
        <description>DCMIPP global interrupt</description>
        <value>48</value>
      </interrupt>
      <registers>
        <register>
          <name>IPGR1</name>
          <displayName>IPGR1</displayName>
          <description>DCMIPP IPPLUG global register 1</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MEMORYPAGE</name>
              <description>Memory page size, as power of 2 of 64-byte units:</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QOS_MODE</name>
              <description>Quality of service</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPGR2</name>
          <displayName>IPGR2</displayName>
          <description>DCMIPP IPPLUG global register 2</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PSTART</name>
              <description>Request to lock the IP-Plug, to allow reconfiguration.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPGR3</name>
          <displayName>IPGR3</displayName>
          <description>DCMIPP IPPLUG global register 3</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDLE</name>
              <description>Status of IP-Plug</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPGR8</name>
          <displayName>IPGR8</displayName>
          <description>DCMIPP IPPLUG identification register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <resetValue>0xAA040314</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DID</name>
              <description>Division identifier (0x14)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REVID</name>
              <description>Revision identifier (0x03)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ARCHIID</name>
              <description>Architecture identifier (0x04)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IPPID</name>
              <description>IP identifier (0xAA)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC1R1</name>
          <displayName>IPC1R1</displayName>
          <description>DCMIPP IPPLUG Clientx register 1</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000004</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRAFFIC</name>
              <description>Burst size as power of 2 of 8-byte units</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OTR</name>
              <description>Maximum outstanding transactions</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC1R2</name>
          <displayName>IPC1R2</displayName>
          <description>DCMIPP IPPLUG Clientx register 2</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <resetValue>0x00010000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SVCMAPPING</name>
              <description>Non-user, must be kept at reset value.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WLRU</name>
              <description>Ratio for WLRU[3:0] arbitration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC1R3</name>
          <displayName>IPC1R3</displayName>
          <description>DCMIPP IPPLUG Clientx register 3</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <resetValue>0x007F0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DPREGSTART</name>
              <description>Start word (AXI width = 64 bits) of the FIFO of Clientx.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPREGEND</name>
              <description>End word (AXI width = 64 bits) of the FIFO of Clientx.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC2R1</name>
          <displayName>IPC2R1</displayName>
          <description>DCMIPP IPPLUG Clientx register 1</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000004</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRAFFIC</name>
              <description>Burst size as power of 2 of 8-byte units</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OTR</name>
              <description>Maximum outstanding transactions</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC2R2</name>
          <displayName>IPC2R2</displayName>
          <description>DCMIPP IPPLUG Clientx register 2</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <resetValue>0x00010000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SVCMAPPING</name>
              <description>Non-user, must be kept at reset value.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WLRU</name>
              <description>Ratio for WLRU[3:0] arbitration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC2R3</name>
          <displayName>IPC2R3</displayName>
          <description>DCMIPP IPPLUG Clientx register 3</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <resetValue>0x013F0080</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DPREGSTART</name>
              <description>Start word (AXI width = 64 bits) of the FIFO of Clientx.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPREGEND</name>
              <description>End word (AXI width = 64 bits) of the FIFO of Clientx.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC3R1</name>
          <displayName>IPC3R1</displayName>
          <description>DCMIPP IPPLUG Clientx register 1</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000004</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRAFFIC</name>
              <description>Burst size as power of 2 of 8-byte units</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OTR</name>
              <description>Maximum outstanding transactions</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC3R2</name>
          <displayName>IPC3R2</displayName>
          <description>DCMIPP IPPLUG Clientx register 2</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <resetValue>0x00010000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SVCMAPPING</name>
              <description>Non-user, must be kept at reset value.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WLRU</name>
              <description>Ratio for WLRU[3:0] arbitration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC3R3</name>
          <displayName>IPC3R3</displayName>
          <description>DCMIPP IPPLUG Clientx register 3</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <resetValue>0x018F0140</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DPREGSTART</name>
              <description>Start word (AXI width = 64 bits) of the FIFO of Clientx.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPREGEND</name>
              <description>End word (AXI width = 64 bits) of the FIFO of Clientx.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC4R1</name>
          <displayName>IPC4R1</displayName>
          <description>DCMIPP IPPLUG Clientx register 1</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000004</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRAFFIC</name>
              <description>Burst size as power of 2 of 8-byte units</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OTR</name>
              <description>Maximum outstanding transactions</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC4R2</name>
          <displayName>IPC4R2</displayName>
          <description>DCMIPP IPPLUG Clientx register 2</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <resetValue>0x00010000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SVCMAPPING</name>
              <description>Non-user, must be kept at reset value.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WLRU</name>
              <description>Ratio for WLRU[3:0] arbitration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC4R3</name>
          <displayName>IPC4R3</displayName>
          <description>DCMIPP IPPLUG Clientx register 3</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <resetValue>0x01BF0190</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DPREGSTART</name>
              <description>Start word (AXI width = 64 bits) of the FIFO of Clientx.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPREGEND</name>
              <description>End word (AXI width = 64 bits) of the FIFO of Clientx.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC5R1</name>
          <displayName>IPC5R1</displayName>
          <description>DCMIPP IPPLUG Clientx register 1</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000004</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRAFFIC</name>
              <description>Burst size as power of 2 of 8-byte units</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OTR</name>
              <description>Maximum outstanding transactions</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC5R2</name>
          <displayName>IPC5R2</displayName>
          <description>DCMIPP IPPLUG Clientx register 2</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <resetValue>0x00010000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SVCMAPPING</name>
              <description>Non-user, must be kept at reset value.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WLRU</name>
              <description>Ratio for WLRU[3:0] arbitration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC5R3</name>
          <displayName>IPC5R3</displayName>
          <description>DCMIPP IPPLUG Clientx register 3</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <resetValue>0x027F01C0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DPREGSTART</name>
              <description>Start word (AXI width = 64 bits) of the FIFO of Clientx.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPREGEND</name>
              <description>End word (AXI width = 64 bits) of the FIFO of Clientx.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRCR</name>
          <displayName>PRCR</displayName>
          <description>DCMIPP parallel interface control register</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ESS</name>
              <description>Embedded synchronization select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCKPOL</name>
              <description>Pixel clock polarity</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HSPOL</name>
              <description>Horizontal synchronization polarity</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VSPOL</name>
              <description>Vertical synchronization polarity</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EDM</name>
              <description>Extended data mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Parallel interface enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORMAT</name>
              <description>Other values: data are captured and output as-is only through the data/dump pipeline (e.g. JPEG or byte input format).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWAPCYCLES</name>
              <description>Swap data (cycle 0 vs. cycle 1) for pixels received on two cycles</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWAPBITS</name>
              <description>Swap LSB vs. MSB within each received component</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRESCR</name>
          <displayName>PRESCR</displayName>
          <description>DCMIPP parallel interface embedded synchronization code register</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FSC</name>
              <description>Frame start delimiter code</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSC</name>
              <description>Line start delimiter code</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEC</name>
              <description>Line end delimiter code</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEC</name>
              <description>Frame end delimiter code</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
