knieriem/tinygo-stm32-svd/svd/stm32n655.svd
        <register>
          <name>IER4</name>
          <displayName>IER4</displayName>
          <description>IAC interrupt enable register 4</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IAIE128</name>
              <description>illegal access interrupt enable for peripheral 128</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE129</name>
              <description>illegal access interrupt enable for peripheral 129</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE130</name>
              <description>illegal access interrupt enable for peripheral 130</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE131</name>
              <description>illegal access interrupt enable for peripheral 131</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE132</name>
              <description>illegal access interrupt enable for peripheral 132</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE133</name>
              <description>illegal access interrupt enable for peripheral 133</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE134</name>
              <description>illegal access interrupt enable for peripheral 134</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE135</name>
              <description>illegal access interrupt enable for peripheral 135</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE136</name>
              <description>illegal access interrupt enable for peripheral 136</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE137</name>
              <description>illegal access interrupt enable for peripheral 137</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE138</name>
              <description>illegal access interrupt enable for peripheral 138</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE139</name>
              <description>illegal access interrupt enable for peripheral 139</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE140</name>
              <description>illegal access interrupt enable for peripheral 140</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE141</name>
              <description>illegal access interrupt enable for peripheral 141</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE142</name>
              <description>illegal access interrupt enable for peripheral 142</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE143</name>
              <description>illegal access interrupt enable for peripheral 143</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE144</name>
              <description>illegal access interrupt enable for peripheral 144</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE145</name>
              <description>illegal access interrupt enable for peripheral 145</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE146</name>
              <description>illegal access interrupt enable for peripheral 146</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE147</name>
              <description>illegal access interrupt enable for peripheral 147</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE148</name>
              <description>illegal access interrupt enable for peripheral 148</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE149</name>
              <description>illegal access interrupt enable for peripheral 149</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE150</name>
              <description>illegal access interrupt enable for peripheral 150</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE151</name>
              <description>illegal access interrupt enable for peripheral 151</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE152</name>
              <description>illegal access interrupt enable for peripheral 152</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE153</name>
              <description>illegal access interrupt enable for peripheral 153</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE154</name>
              <description>illegal access interrupt enable for peripheral 154</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE155</name>
              <description>illegal access interrupt enable for peripheral 155</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE156</name>
              <description>illegal access interrupt enable for peripheral 156</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE157</name>
              <description>illegal access interrupt enable for peripheral 157</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE158</name>
              <description>illegal access interrupt enable for peripheral 158</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE159</name>
              <description>illegal access interrupt enable for peripheral 159</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IER5</name>
          <displayName>IER5</displayName>
          <description>IAC interrupt enable register 5</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IAIE160</name>
              <description>illegal access interrupt enable for peripheral 160</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE161</name>
              <description>illegal access interrupt enable for peripheral 161</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE162</name>
              <description>illegal access interrupt enable for peripheral 162</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE163</name>
              <description>illegal access interrupt enable for peripheral 163</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE164</name>
              <description>illegal access interrupt enable for peripheral 164</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE165</name>
              <description>illegal access interrupt enable for peripheral 165</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE166</name>
              <description>illegal access interrupt enable for peripheral 166</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE167</name>
              <description>illegal access interrupt enable for peripheral 167</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE168</name>
              <description>illegal access interrupt enable for peripheral 168</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE169</name>
              <description>illegal access interrupt enable for peripheral 169</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE170</name>
              <description>illegal access interrupt enable for peripheral 170</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE171</name>
              <description>illegal access interrupt enable for peripheral 171</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE172</name>
              <description>illegal access interrupt enable for peripheral 172</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE173</name>
              <description>illegal access interrupt enable for peripheral 173</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE174</name>
              <description>illegal access interrupt enable for peripheral 174</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE175</name>
              <description>illegal access interrupt enable for peripheral 175</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE176</name>
              <description>illegal access interrupt enable for peripheral 176</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE177</name>
              <description>illegal access interrupt enable for peripheral 177</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE178</name>
              <description>illegal access interrupt enable for peripheral 178</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE179</name>
              <description>illegal access interrupt enable for peripheral 179</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE180</name>
              <description>illegal access interrupt enable for peripheral 180</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE181</name>
              <description>illegal access interrupt enable for peripheral 181</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE182</name>
              <description>illegal access interrupt enable for peripheral 182</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE183</name>
              <description>illegal access interrupt enable for peripheral 183</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE184</name>
              <description>illegal access interrupt enable for peripheral 184</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE185</name>
              <description>illegal access interrupt enable for peripheral 185</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE186</name>
              <description>illegal access interrupt enable for peripheral 186</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE187</name>
              <description>illegal access interrupt enable for peripheral 187</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE188</name>
              <description>illegal access interrupt enable for peripheral 188</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE189</name>
              <description>illegal access interrupt enable for peripheral 189</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE190</name>
              <description>illegal access interrupt enable for peripheral 190</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IAIE191</name>
              <description>illegal access interrupt enable for peripheral 191</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
