knieriem/tinygo-stm32-svd/svd/stm32n655.svd
        <register>
          <name>HUFFENC_AC1_41</name>
          <displayName>HUFFENC_AC1_41</displayName>
          <description>JPEG Huffman encoder AC1</description>
          <addressOffset>0x704</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE82</name>
              <description>Huffman code 82</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN82</name>
              <description>Huffman length 82</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE83</name>
              <description>Huffman code 83</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN83</name>
              <description>Huffman length 83</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_42</name>
          <displayName>HUFFENC_AC1_42</displayName>
          <description>JPEG Huffman encoder AC1</description>
          <addressOffset>0x708</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE84</name>
              <description>Huffman code 84</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN84</name>
              <description>Huffman length 84</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE85</name>
              <description>Huffman code 85</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN85</name>
              <description>Huffman length 85</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_43</name>
          <displayName>HUFFENC_AC1_43</displayName>
          <description>JPEG Huffman encoder AC1</description>
          <addressOffset>0x70C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE86</name>
              <description>Huffman code 86</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN86</name>
              <description>Huffman length 86</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE87</name>
              <description>Huffman code 87</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN87</name>
              <description>Huffman length 87</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_44</name>
          <displayName>HUFFENC_AC1_44</displayName>
          <description>JPEG Huffman encoder AC1</description>
          <addressOffset>0x710</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE88</name>
              <description>Huffman code 88</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN88</name>
              <description>Huffman length 88</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE89</name>
              <description>Huffman code 89</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN89</name>
              <description>Huffman length 89</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_45</name>
          <displayName>HUFFENC_AC1_45</displayName>
          <description>JPEG Huffman encoder AC1</description>
          <addressOffset>0x714</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE90</name>
              <description>Huffman code 90</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN90</name>
              <description>Huffman length 90</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE91</name>
              <description>Huffman code 91</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN91</name>
              <description>Huffman length 91</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_46</name>
          <displayName>HUFFENC_AC1_46</displayName>
          <description>JPEG Huffman encoder AC1</description>
          <addressOffset>0x718</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE92</name>
              <description>Huffman code 92</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN92</name>
              <description>Huffman length 92</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE93</name>
              <description>Huffman code 93</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN93</name>
              <description>Huffman length 93</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_47</name>
          <displayName>HUFFENC_AC1_47</displayName>
          <description>JPEG Huffman encoder AC1</description>
          <addressOffset>0x71C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE94</name>
              <description>Huffman code 94</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN94</name>
              <description>Huffman length 94</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE95</name>
              <description>Huffman code 95</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN95</name>
              <description>Huffman length 95</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_48</name>
          <displayName>HUFFENC_AC1_48</displayName>
          <description>JPEG Huffman encoder AC1</description>
          <addressOffset>0x720</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE96</name>
              <description>Huffman code 96</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN96</name>
              <description>Huffman length 96</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE97</name>
              <description>Huffman code 97</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN97</name>
              <description>Huffman length 97</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_49</name>
          <displayName>HUFFENC_AC1_49</displayName>
          <description>JPEG Huffman encoder AC1</description>
          <addressOffset>0x724</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE98</name>
              <description>Huffman code 98</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN98</name>
              <description>Huffman length 98</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE99</name>
              <description>Huffman code 99</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN99</name>
              <description>Huffman length 99</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_50</name>
          <displayName>HUFFENC_AC1_50</displayName>
          <description>JPEG Huffman encoder AC1</description>
          <addressOffset>0x728</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE100</name>
              <description>Huffman code 100</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN100</name>
              <description>Huffman length 100</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE101</name>
              <description>Huffman code 101</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN101</name>
              <description>Huffman length 101</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_51</name>
          <displayName>HUFFENC_AC1_51</displayName>
          <description>JPEG Huffman encoder AC1</description>
          <addressOffset>0x72C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE102</name>
              <description>Huffman code 102</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN102</name>
              <description>Huffman length 102</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE103</name>
              <description>Huffman code 103</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN103</name>
              <description>Huffman length 103</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_52</name>
          <displayName>HUFFENC_AC1_52</displayName>
          <description>JPEG Huffman encoder AC1</description>
          <addressOffset>0x730</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE104</name>
              <description>Huffman code 104</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN104</name>
              <description>Huffman length 104</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE105</name>
              <description>Huffman code 105</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN105</name>
              <description>Huffman length 105</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_53</name>
          <displayName>HUFFENC_AC1_53</displayName>
          <description>JPEG Huffman encoder AC1</description>
          <addressOffset>0x734</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE106</name>
              <description>Huffman code 106</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN106</name>
              <description>Huffman length 106</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE107</name>
              <description>Huffman code 107</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN107</name>
              <description>Huffman length 107</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_54</name>
          <displayName>HUFFENC_AC1_54</displayName>
          <description>JPEG Huffman encoder AC1</description>
          <addressOffset>0x738</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE108</name>
              <description>Huffman code 108</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN108</name>
              <description>Huffman length 108</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE109</name>
              <description>Huffman code 109</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN109</name>
              <description>Huffman length 109</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_55</name>
          <displayName>HUFFENC_AC1_55</displayName>
          <description>JPEG Huffman encoder AC1</description>
          <addressOffset>0x73C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE110</name>
              <description>Huffman code 110</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN110</name>
              <description>Huffman length 110</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE111</name>
              <description>Huffman code 111</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN111</name>
              <description>Huffman length 111</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_56</name>
          <displayName>HUFFENC_AC1_56</displayName>
          <description>JPEG Huffman encoder AC1</description>
          <addressOffset>0x740</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE112</name>
              <description>Huffman code 112</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN112</name>
              <description>Huffman length 112</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE113</name>
              <description>Huffman code 113</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN113</name>
              <description>Huffman length 113</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_57</name>
          <displayName>HUFFENC_AC1_57</displayName>
          <description>JPEG Huffman encoder AC1</description>
          <addressOffset>0x744</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE114</name>
              <description>Huffman code 114</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN114</name>
              <description>Huffman length 114</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE115</name>
              <description>Huffman code 115</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN115</name>
              <description>Huffman length 115</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
