knieriem/tinygo-stm32-svd/svd/stm32n655.svd
        <register>
          <name>MKEYR2</name>
          <displayName>MKEYR2</displayName>
          <description>.MCE master key 2</description>
          <addressOffset>0x208</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MKEY64</name>
              <description>Master key bit 64 (i = 31 to 0)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY65</name>
              <description>Master key bit 65 (i = 31 to 0)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY66</name>
              <description>Master key bit 66 (i = 31 to 0)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY67</name>
              <description>Master key bit 67 (i = 31 to 0)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY68</name>
              <description>Master key bit 68 (i = 31 to 0)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY69</name>
              <description>Master key bit 69 (i = 31 to 0)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY70</name>
              <description>Master key bit 70 (i = 31 to 0)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY71</name>
              <description>Master key bit 71 (i = 31 to 0)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY72</name>
              <description>Master key bit 72 (i = 31 to 0)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY73</name>
              <description>Master key bit 73 (i = 31 to 0)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY74</name>
              <description>Master key bit 74 (i = 31 to 0)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY75</name>
              <description>Master key bit 75 (i = 31 to 0)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY76</name>
              <description>Master key bit 76 (i = 31 to 0)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY77</name>
              <description>Master key bit 77 (i = 31 to 0)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY78</name>
              <description>Master key bit 78 (i = 31 to 0)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY79</name>
              <description>Master key bit 79 (i = 31 to 0)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY80</name>
              <description>Master key bit 80 (i = 31 to 0)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY81</name>
              <description>Master key bit 81 (i = 31 to 0)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY82</name>
              <description>Master key bit 82 (i = 31 to 0)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY83</name>
              <description>Master key bit 83 (i = 31 to 0)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY84</name>
              <description>Master key bit 84 (i = 31 to 0)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY85</name>
              <description>Master key bit 85 (i = 31 to 0)</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY86</name>
              <description>Master key bit 86 (i = 31 to 0)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY87</name>
              <description>Master key bit 87 (i = 31 to 0)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY88</name>
              <description>Master key bit 88 (i = 31 to 0)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY89</name>
              <description>Master key bit 89 (i = 31 to 0)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY90</name>
              <description>Master key bit 90 (i = 31 to 0)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY91</name>
              <description>Master key bit 91 (i = 31 to 0)</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY92</name>
              <description>Master key bit 92 (i = 31 to 0)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY93</name>
              <description>Master key bit 93 (i = 31 to 0)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY94</name>
              <description>Master key bit 94 (i = 31 to 0)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY95</name>
              <description>Master key bit 95 (i = 31 to 0)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MKEYR3</name>
          <displayName>MKEYR3</displayName>
          <description>.MCE master key 3</description>
          <addressOffset>0x20C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MKEY96</name>
              <description>Master key bit 96 (i = 31 to 0)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY97</name>
              <description>Master key bit 97 (i = 31 to 0)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY98</name>
              <description>Master key bit 98 (i = 31 to 0)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY99</name>
              <description>Master key bit 99 (i = 31 to 0)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY100</name>
              <description>Master key bit 100 (i = 31 to 0)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY101</name>
              <description>Master key bit 101 (i = 31 to 0)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY102</name>
              <description>Master key bit 102 (i = 31 to 0)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY103</name>
              <description>Master key bit 103 (i = 31 to 0)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY104</name>
              <description>Master key bit 104 (i = 31 to 0)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY105</name>
              <description>Master key bit 105 (i = 31 to 0)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY106</name>
              <description>Master key bit 106 (i = 31 to 0)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY107</name>
              <description>Master key bit 107 (i = 31 to 0)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY108</name>
              <description>Master key bit 108 (i = 31 to 0)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY109</name>
              <description>Master key bit 109 (i = 31 to 0)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY110</name>
              <description>Master key bit 110 (i = 31 to 0)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY111</name>
              <description>Master key bit 111 (i = 31 to 0)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY112</name>
              <description>Master key bit 112 (i = 31 to 0)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY113</name>
              <description>Master key bit 113 (i = 31 to 0)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY114</name>
              <description>Master key bit 114 (i = 31 to 0)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY115</name>
              <description>Master key bit 115 (i = 31 to 0)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY116</name>
              <description>Master key bit 116 (i = 31 to 0)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY117</name>
              <description>Master key bit 117 (i = 31 to 0)</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY118</name>
              <description>Master key bit 118 (i = 31 to 0)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY119</name>
              <description>Master key bit 119 (i = 31 to 0)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY120</name>
              <description>Master key bit 120 (i = 31 to 0)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY121</name>
              <description>Master key bit 121 (i = 31 to 0)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY122</name>
              <description>Master key bit 122 (i = 31 to 0)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY123</name>
              <description>Master key bit 123 (i = 31 to 0)</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY124</name>
              <description>Master key bit 124 (i = 31 to 0)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY125</name>
              <description>Master key bit 125 (i = 31 to 0)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY126</name>
              <description>Master key bit 126 (i = 31 to 0)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY127</name>
              <description>Master key bit 127 (i = 31 to 0)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
