knieriem/tinygo-stm32-svd/svd/stm32n655.svd
        <register>
          <name>MKEYR4</name>
          <displayName>MKEYR4</displayName>
          <description>.MCE master key 4</description>
          <addressOffset>0x210</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MKEY128</name>
              <description>Master key bit 128 (i = 31 to 0)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY129</name>
              <description>Master key bit 129 (i = 31 to 0)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY130</name>
              <description>Master key bit 130 (i = 31 to 0)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY131</name>
              <description>Master key bit 131 (i = 31 to 0)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY132</name>
              <description>Master key bit 132 (i = 31 to 0)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY133</name>
              <description>Master key bit 133 (i = 31 to 0)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY134</name>
              <description>Master key bit 134 (i = 31 to 0)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY135</name>
              <description>Master key bit 135 (i = 31 to 0)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY136</name>
              <description>Master key bit 136 (i = 31 to 0)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY137</name>
              <description>Master key bit 137 (i = 31 to 0)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY138</name>
              <description>Master key bit 138 (i = 31 to 0)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY139</name>
              <description>Master key bit 139 (i = 31 to 0)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY140</name>
              <description>Master key bit 140 (i = 31 to 0)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY141</name>
              <description>Master key bit 141 (i = 31 to 0)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY142</name>
              <description>Master key bit 142 (i = 31 to 0)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY143</name>
              <description>Master key bit 143 (i = 31 to 0)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY144</name>
              <description>Master key bit 144 (i = 31 to 0)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY145</name>
              <description>Master key bit 145 (i = 31 to 0)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY146</name>
              <description>Master key bit 146 (i = 31 to 0)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY147</name>
              <description>Master key bit 147 (i = 31 to 0)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY148</name>
              <description>Master key bit 148 (i = 31 to 0)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY149</name>
              <description>Master key bit 149 (i = 31 to 0)</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY150</name>
              <description>Master key bit 150 (i = 31 to 0)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY151</name>
              <description>Master key bit 151 (i = 31 to 0)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY152</name>
              <description>Master key bit 152 (i = 31 to 0)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY153</name>
              <description>Master key bit 153 (i = 31 to 0)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY154</name>
              <description>Master key bit 154 (i = 31 to 0)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY155</name>
              <description>Master key bit 155 (i = 31 to 0)</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY156</name>
              <description>Master key bit 156 (i = 31 to 0)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY157</name>
              <description>Master key bit 157 (i = 31 to 0)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY158</name>
              <description>Master key bit 158 (i = 31 to 0)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY159</name>
              <description>Master key bit 159 (i = 31 to 0)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MKEYR5</name>
          <displayName>MKEYR5</displayName>
          <description>.MCE master key 5</description>
          <addressOffset>0x214</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MKEY160</name>
              <description>Master key bit 160 (i = 31 to 0)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY161</name>
              <description>Master key bit 161 (i = 31 to 0)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY162</name>
              <description>Master key bit 162 (i = 31 to 0)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY163</name>
              <description>Master key bit 163 (i = 31 to 0)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY164</name>
              <description>Master key bit 164 (i = 31 to 0)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY165</name>
              <description>Master key bit 165 (i = 31 to 0)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY166</name>
              <description>Master key bit 166 (i = 31 to 0)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY167</name>
              <description>Master key bit 167 (i = 31 to 0)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY168</name>
              <description>Master key bit 168 (i = 31 to 0)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY169</name>
              <description>Master key bit 169 (i = 31 to 0)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY170</name>
              <description>Master key bit 170 (i = 31 to 0)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY171</name>
              <description>Master key bit 171 (i = 31 to 0)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY172</name>
              <description>Master key bit 172 (i = 31 to 0)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY173</name>
              <description>Master key bit 173 (i = 31 to 0)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY174</name>
              <description>Master key bit 174 (i = 31 to 0)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY175</name>
              <description>Master key bit 175 (i = 31 to 0)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY176</name>
              <description>Master key bit 176 (i = 31 to 0)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY177</name>
              <description>Master key bit 177 (i = 31 to 0)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY178</name>
              <description>Master key bit 178 (i = 31 to 0)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY179</name>
              <description>Master key bit 179 (i = 31 to 0)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY180</name>
              <description>Master key bit 180 (i = 31 to 0)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY181</name>
              <description>Master key bit 181 (i = 31 to 0)</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY182</name>
              <description>Master key bit 182 (i = 31 to 0)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY183</name>
              <description>Master key bit 183 (i = 31 to 0)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY184</name>
              <description>Master key bit 184 (i = 31 to 0)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY185</name>
              <description>Master key bit 185 (i = 31 to 0)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY186</name>
              <description>Master key bit 186 (i = 31 to 0)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY187</name>
              <description>Master key bit 187 (i = 31 to 0)</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY188</name>
              <description>Master key bit 188 (i = 31 to 0)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY189</name>
              <description>Master key bit 189 (i = 31 to 0)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY190</name>
              <description>Master key bit 190 (i = 31 to 0)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY191</name>
              <description>Master key bit 191 (i = 31 to 0)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
