knieriem/tinygo-stm32-svd/svd/stm32n655.svd
        <register>
          <name>MKEYR6</name>
          <displayName>MKEYR6</displayName>
          <description>.MCE master key 6</description>
          <addressOffset>0x218</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MKEY192</name>
              <description>Master key bit 192 (i = 31 to 0)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY193</name>
              <description>Master key bit 193 (i = 31 to 0)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY194</name>
              <description>Master key bit 194 (i = 31 to 0)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY195</name>
              <description>Master key bit 195 (i = 31 to 0)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY196</name>
              <description>Master key bit 196 (i = 31 to 0)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY197</name>
              <description>Master key bit 197 (i = 31 to 0)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY198</name>
              <description>Master key bit 198 (i = 31 to 0)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY199</name>
              <description>Master key bit 199 (i = 31 to 0)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY200</name>
              <description>Master key bit 200 (i = 31 to 0)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY201</name>
              <description>Master key bit 201 (i = 31 to 0)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY202</name>
              <description>Master key bit 202 (i = 31 to 0)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY203</name>
              <description>Master key bit 203 (i = 31 to 0)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY204</name>
              <description>Master key bit 204 (i = 31 to 0)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY205</name>
              <description>Master key bit 205 (i = 31 to 0)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY206</name>
              <description>Master key bit 206 (i = 31 to 0)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY207</name>
              <description>Master key bit 207 (i = 31 to 0)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY208</name>
              <description>Master key bit 208 (i = 31 to 0)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY209</name>
              <description>Master key bit 209 (i = 31 to 0)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY210</name>
              <description>Master key bit 210 (i = 31 to 0)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY211</name>
              <description>Master key bit 211 (i = 31 to 0)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY212</name>
              <description>Master key bit 212 (i = 31 to 0)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY213</name>
              <description>Master key bit 213 (i = 31 to 0)</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY214</name>
              <description>Master key bit 214 (i = 31 to 0)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY215</name>
              <description>Master key bit 215 (i = 31 to 0)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY216</name>
              <description>Master key bit 216 (i = 31 to 0)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY217</name>
              <description>Master key bit 217 (i = 31 to 0)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY218</name>
              <description>Master key bit 218 (i = 31 to 0)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY219</name>
              <description>Master key bit 219 (i = 31 to 0)</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY220</name>
              <description>Master key bit 220 (i = 31 to 0)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY221</name>
              <description>Master key bit 221 (i = 31 to 0)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY222</name>
              <description>Master key bit 222 (i = 31 to 0)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY223</name>
              <description>Master key bit 223 (i = 31 to 0)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MKEYR7</name>
          <displayName>MKEYR7</displayName>
          <description>.MCE master key 7</description>
          <addressOffset>0x21C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MKEY224</name>
              <description>Master key bit 224 (i = 31 to 0)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY225</name>
              <description>Master key bit 225 (i = 31 to 0)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY226</name>
              <description>Master key bit 226 (i = 31 to 0)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY227</name>
              <description>Master key bit 227 (i = 31 to 0)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY228</name>
              <description>Master key bit 228 (i = 31 to 0)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY229</name>
              <description>Master key bit 229 (i = 31 to 0)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY230</name>
              <description>Master key bit 230 (i = 31 to 0)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY231</name>
              <description>Master key bit 231 (i = 31 to 0)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY232</name>
              <description>Master key bit 232 (i = 31 to 0)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY233</name>
              <description>Master key bit 233 (i = 31 to 0)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY234</name>
              <description>Master key bit 234 (i = 31 to 0)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY235</name>
              <description>Master key bit 235 (i = 31 to 0)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY236</name>
              <description>Master key bit 236 (i = 31 to 0)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY237</name>
              <description>Master key bit 237 (i = 31 to 0)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY238</name>
              <description>Master key bit 238 (i = 31 to 0)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY239</name>
              <description>Master key bit 239 (i = 31 to 0)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY240</name>
              <description>Master key bit 240 (i = 31 to 0)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY241</name>
              <description>Master key bit 241 (i = 31 to 0)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY242</name>
              <description>Master key bit 242 (i = 31 to 0)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY243</name>
              <description>Master key bit 243 (i = 31 to 0)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY244</name>
              <description>Master key bit 244 (i = 31 to 0)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY245</name>
              <description>Master key bit 245 (i = 31 to 0)</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY246</name>
              <description>Master key bit 246 (i = 31 to 0)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY247</name>
              <description>Master key bit 247 (i = 31 to 0)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY248</name>
              <description>Master key bit 248 (i = 31 to 0)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY249</name>
              <description>Master key bit 249 (i = 31 to 0)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY250</name>
              <description>Master key bit 250 (i = 31 to 0)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY251</name>
              <description>Master key bit 251 (i = 31 to 0)</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY252</name>
              <description>Master key bit 252 (i = 31 to 0)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY253</name>
              <description>Master key bit 253 (i = 31 to 0)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY254</name>
              <description>Master key bit 254 (i = 31 to 0)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY255</name>
              <description>Master key bit 255 (i = 31 to 0)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
