knieriem/tinygo-stm32-svd/svd/stm32n655.svd
        <register>
          <name>FMKEYR0</name>
          <displayName>FMKEYR0</displayName>
          <description>MCE fast master key 0</description>
          <addressOffset>0x220</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FMKEY0</name>
              <description>Fast master key bit 0 (i = 31 to 0)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY1</name>
              <description>Fast master key bit 1 (i = 31 to 0)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY2</name>
              <description>Fast master key bit 2 (i = 31 to 0)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY3</name>
              <description>Fast master key bit 3 (i = 31 to 0)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY4</name>
              <description>Fast master key bit 4 (i = 31 to 0)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY5</name>
              <description>Fast master key bit 5 (i = 31 to 0)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY6</name>
              <description>Fast master key bit 6 (i = 31 to 0)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY7</name>
              <description>Fast master key bit 7 (i = 31 to 0)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY8</name>
              <description>Fast master key bit 8 (i = 31 to 0)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY9</name>
              <description>Fast master key bit 9 (i = 31 to 0)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY10</name>
              <description>Fast master key bit 10 (i = 31 to 0)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY11</name>
              <description>Fast master key bit 11 (i = 31 to 0)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY12</name>
              <description>Fast master key bit 12 (i = 31 to 0)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY13</name>
              <description>Fast master key bit 13 (i = 31 to 0)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY14</name>
              <description>Fast master key bit 14 (i = 31 to 0)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY15</name>
              <description>Fast master key bit 15 (i = 31 to 0)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY16</name>
              <description>Fast master key bit 16 (i = 31 to 0)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY17</name>
              <description>Fast master key bit 17 (i = 31 to 0)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY18</name>
              <description>Fast master key bit 18 (i = 31 to 0)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY19</name>
              <description>Fast master key bit 19 (i = 31 to 0)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY20</name>
              <description>Fast master key bit 20 (i = 31 to 0)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY21</name>
              <description>Fast master key bit 21 (i = 31 to 0)</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY22</name>
              <description>Fast master key bit 22 (i = 31 to 0)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY23</name>
              <description>Fast master key bit 23 (i = 31 to 0)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY24</name>
              <description>Fast master key bit 24 (i = 31 to 0)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY25</name>
              <description>Fast master key bit 25 (i = 31 to 0)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY26</name>
              <description>Fast master key bit 26 (i = 31 to 0)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY27</name>
              <description>Fast master key bit 27 (i = 31 to 0)</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY28</name>
              <description>Fast master key bit 28 (i = 31 to 0)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY29</name>
              <description>Fast master key bit 29 (i = 31 to 0)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY30</name>
              <description>Fast master key bit 30 (i = 31 to 0)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY31</name>
              <description>Fast master key bit 31 (i = 31 to 0)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FMKEYR1</name>
          <displayName>FMKEYR1</displayName>
          <description>MCE fast master key 1</description>
          <addressOffset>0x224</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FMKEY32</name>
              <description>Fast master key bit 32 (i = 31 to 0)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY33</name>
              <description>Fast master key bit 33 (i = 31 to 0)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY34</name>
              <description>Fast master key bit 34 (i = 31 to 0)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY35</name>
              <description>Fast master key bit 35 (i = 31 to 0)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY36</name>
              <description>Fast master key bit 36 (i = 31 to 0)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY37</name>
              <description>Fast master key bit 37 (i = 31 to 0)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY38</name>
              <description>Fast master key bit 38 (i = 31 to 0)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY39</name>
              <description>Fast master key bit 39 (i = 31 to 0)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY40</name>
              <description>Fast master key bit 40 (i = 31 to 0)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY41</name>
              <description>Fast master key bit 41 (i = 31 to 0)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY42</name>
              <description>Fast master key bit 42 (i = 31 to 0)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY43</name>
              <description>Fast master key bit 43 (i = 31 to 0)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY44</name>
              <description>Fast master key bit 44 (i = 31 to 0)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY45</name>
              <description>Fast master key bit 45 (i = 31 to 0)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY46</name>
              <description>Fast master key bit 46 (i = 31 to 0)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY47</name>
              <description>Fast master key bit 47 (i = 31 to 0)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY48</name>
              <description>Fast master key bit 48 (i = 31 to 0)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY49</name>
              <description>Fast master key bit 49 (i = 31 to 0)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY50</name>
              <description>Fast master key bit 50 (i = 31 to 0)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY51</name>
              <description>Fast master key bit 51 (i = 31 to 0)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY52</name>
              <description>Fast master key bit 52 (i = 31 to 0)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY53</name>
              <description>Fast master key bit 53 (i = 31 to 0)</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY54</name>
              <description>Fast master key bit 54 (i = 31 to 0)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY55</name>
              <description>Fast master key bit 55 (i = 31 to 0)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY56</name>
              <description>Fast master key bit 56 (i = 31 to 0)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY57</name>
              <description>Fast master key bit 57 (i = 31 to 0)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY58</name>
              <description>Fast master key bit 58 (i = 31 to 0)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY59</name>
              <description>Fast master key bit 59 (i = 31 to 0)</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY60</name>
              <description>Fast master key bit 60 (i = 31 to 0)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY61</name>
              <description>Fast master key bit 61 (i = 31 to 0)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY62</name>
              <description>Fast master key bit 62 (i = 31 to 0)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY63</name>
              <description>Fast master key bit 63 (i = 31 to 0)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
