knieriem/tinygo-stm32-svd/svd/stm32n655.svd
        <register>
          <name>FMKEYR2</name>
          <displayName>FMKEYR2</displayName>
          <description>MCE fast master key 2</description>
          <addressOffset>0x228</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FMKEY64</name>
              <description>Fast master key bit 64 (i = 31 to 0)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY65</name>
              <description>Fast master key bit 65 (i = 31 to 0)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY66</name>
              <description>Fast master key bit 66 (i = 31 to 0)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY67</name>
              <description>Fast master key bit 67 (i = 31 to 0)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY68</name>
              <description>Fast master key bit 68 (i = 31 to 0)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY69</name>
              <description>Fast master key bit 69 (i = 31 to 0)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY70</name>
              <description>Fast master key bit 70 (i = 31 to 0)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY71</name>
              <description>Fast master key bit 71 (i = 31 to 0)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY72</name>
              <description>Fast master key bit 72 (i = 31 to 0)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY73</name>
              <description>Fast master key bit 73 (i = 31 to 0)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY74</name>
              <description>Fast master key bit 74 (i = 31 to 0)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY75</name>
              <description>Fast master key bit 75 (i = 31 to 0)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY76</name>
              <description>Fast master key bit 76 (i = 31 to 0)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY77</name>
              <description>Fast master key bit 77 (i = 31 to 0)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY78</name>
              <description>Fast master key bit 78 (i = 31 to 0)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY79</name>
              <description>Fast master key bit 79 (i = 31 to 0)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY80</name>
              <description>Fast master key bit 80 (i = 31 to 0)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY81</name>
              <description>Fast master key bit 81 (i = 31 to 0)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY82</name>
              <description>Fast master key bit 82 (i = 31 to 0)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY83</name>
              <description>Fast master key bit 83 (i = 31 to 0)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY84</name>
              <description>Fast master key bit 84 (i = 31 to 0)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY85</name>
              <description>Fast master key bit 85 (i = 31 to 0)</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY86</name>
              <description>Fast master key bit 86 (i = 31 to 0)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY87</name>
              <description>Fast master key bit 87 (i = 31 to 0)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY88</name>
              <description>Fast master key bit 88 (i = 31 to 0)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY89</name>
              <description>Fast master key bit 89 (i = 31 to 0)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY90</name>
              <description>Fast master key bit 90 (i = 31 to 0)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY91</name>
              <description>Fast master key bit 91 (i = 31 to 0)</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY92</name>
              <description>Fast master key bit 92 (i = 31 to 0)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY93</name>
              <description>Fast master key bit 93 (i = 31 to 0)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY94</name>
              <description>Fast master key bit 94 (i = 31 to 0)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY95</name>
              <description>Fast master key bit 95 (i = 31 to 0)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FMKEYR3</name>
          <displayName>FMKEYR3</displayName>
          <description>MCE fast master key 3</description>
          <addressOffset>0x22C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FMKEY96</name>
              <description>Fast master key bit 96 (i = 31 to 0)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY97</name>
              <description>Fast master key bit 97 (i = 31 to 0)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY98</name>
              <description>Fast master key bit 98 (i = 31 to 0)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY99</name>
              <description>Fast master key bit 99 (i = 31 to 0)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY100</name>
              <description>Fast master key bit 100 (i = 31 to 0)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY101</name>
              <description>Fast master key bit 101 (i = 31 to 0)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY102</name>
              <description>Fast master key bit 102 (i = 31 to 0)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY103</name>
              <description>Fast master key bit 103 (i = 31 to 0)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY104</name>
              <description>Fast master key bit 104 (i = 31 to 0)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY105</name>
              <description>Fast master key bit 105 (i = 31 to 0)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY106</name>
              <description>Fast master key bit 106 (i = 31 to 0)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY107</name>
              <description>Fast master key bit 107 (i = 31 to 0)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY108</name>
              <description>Fast master key bit 108 (i = 31 to 0)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY109</name>
              <description>Fast master key bit 109 (i = 31 to 0)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY110</name>
              <description>Fast master key bit 110 (i = 31 to 0)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY111</name>
              <description>Fast master key bit 111 (i = 31 to 0)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY112</name>
              <description>Fast master key bit 112 (i = 31 to 0)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY113</name>
              <description>Fast master key bit 113 (i = 31 to 0)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY114</name>
              <description>Fast master key bit 114 (i = 31 to 0)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY115</name>
              <description>Fast master key bit 115 (i = 31 to 0)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY116</name>
              <description>Fast master key bit 116 (i = 31 to 0)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY117</name>
              <description>Fast master key bit 117 (i = 31 to 0)</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY118</name>
              <description>Fast master key bit 118 (i = 31 to 0)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY119</name>
              <description>Fast master key bit 119 (i = 31 to 0)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY120</name>
              <description>Fast master key bit 120 (i = 31 to 0)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY121</name>
              <description>Fast master key bit 121 (i = 31 to 0)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY122</name>
              <description>Fast master key bit 122 (i = 31 to 0)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY123</name>
              <description>Fast master key bit 123 (i = 31 to 0)</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY124</name>
              <description>Fast master key bit 124 (i = 31 to 0)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY125</name>
              <description>Fast master key bit 125 (i = 31 to 0)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY126</name>
              <description>Fast master key bit 126 (i = 31 to 0)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY127</name>
              <description>Fast master key bit 127 (i = 31 to 0)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
