knieriem/tinygo-stm32-svd/svd/stm32n655.svd
        <register>
          <name>PLL3CFGR1</name>
          <displayName>PLL3CFGR1</displayName>
          <description>RCC PLL3 configuration register 1</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <resetValue>0x08000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLL3DIVN</name>
              <description>PLL3 Integer part for the VCO multiplication factor</description>
              <bitOffset>8</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL3DIVM</name>
              <description>PLL3 reference input clock divide frequency ratio</description>
              <bitOffset>20</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL3BYP</name>
              <description>PLL3 bypass</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL3SEL</name>
              <description>PLL3 source selection of the reference clock</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL3CFGR2</name>
          <displayName>PLL3CFGR2</displayName>
          <description>RCC PLL3 configuration register 2</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLL3DIVNFRAC</name>
              <description>PLL3 Fractional part of the VCO multiplication factor</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL3CFGR3</name>
          <displayName>PLL3CFGR3</displayName>
          <description>RCC PLL3 configuration register 3</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <resetValue>0x49000005</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLL3MODSSRST</name>
              <description>PLL3 Modulation Spread Spectrum reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL3DACEN</name>
              <description>PLL3 noise canceling DAC enable in fractional mode.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL3MODSSDIS</name>
              <description>PLL3 Modulation Spread-Spectrum Disable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL3MODDSEN</name>
              <description>PLL3 Modulation Spread-Spectrum (and Fractional Divide) enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL3MODSPRDW</name>
              <description>PLL3 Modulation Down Spread</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL3MODDIV</name>
              <description>PLL3 Modulation Division frequency adjustment</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL3MODSPR</name>
              <description>PLL3 Modulation Spread depth adjustment</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL3PDIV2</name>
              <description>PLL3 VCO frequency divider level 2</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL3PDIV1</name>
              <description>PLL3 VCO frequency divider level 1</description>
              <bitOffset>27</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL3PDIVEN</name>
              <description>PLL3 post divider POSTDIV1, POSTDIV2, and PLL clock output enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL4CFGR1</name>
          <displayName>PLL4CFGR1</displayName>
          <description>RCC PLL4 configuration register 1</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <resetValue>0x08000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLL4DIVN</name>
              <description>PLL4 Integer part for the VCO multiplication factor</description>
              <bitOffset>8</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL4DIVM</name>
              <description>PLL4 reference input clock divide frequency ratio</description>
              <bitOffset>20</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL4BYP</name>
              <description>PLL4 bypass</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL4SEL</name>
              <description>PLL4 source selection of the reference clock</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL4CFGR2</name>
          <displayName>PLL4CFGR2</displayName>
          <description>RCC PLL4 configuration register 2</description>
          <addressOffset>0xB4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLL4DIVNFRAC</name>
              <description>PLL4 Fractional part of the VCO multiplication factor</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL4CFGR3</name>
          <displayName>PLL4CFGR3</displayName>
          <description>RCC PLL4 configuration register 3</description>
          <addressOffset>0xB8</addressOffset>
          <size>0x20</size>
          <resetValue>0x49000005</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLL4MODSSRST</name>
              <description>PLL4 Modulation Spread Spectrum reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL4DACEN</name>
              <description>PLL4 noise canceling DAC enable in fractional mode.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL4MODSSDIS</name>
              <description>PLL4 Modulation Spread-Spectrum Disable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL4MODDSEN</name>
              <description>PLL4 Modulation Spread-Spectrum (and Fractional Divide) enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL4MODSPRDW</name>
              <description>PLL4 Modulation Down Spread</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL4MODDIV</name>
              <description>PLL4 Modulation Division frequency adjustment</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL4MODSPR</name>
              <description>PLL4 Modulation Spread depth adjustment</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL4PDIV2</name>
              <description>PLL4 VCO frequency divider level 2</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL4PDIV1</name>
              <description>PLL4 VCO frequency divider level 1</description>
              <bitOffset>27</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL4PDIVEN</name>
              <description>PLL4 post divider POSTDIV1, POSTDIV2, and PLL clock output enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC1CFGR</name>
          <displayName>IC1CFGR</displayName>
          <description>RCC IC1 configuration register</description>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00020000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IC1INT</name>
              <description>Divider IC1 integer division factor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC1SEL</name>
              <description>Divider IC1 Source Selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC2CFGR</name>
          <displayName>IC2CFGR</displayName>
          <description>RCC IC2 configuration register</description>
          <addressOffset>0xC8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00030000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IC2INT</name>
              <description>Divider IC2 integer division factor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC2SEL</name>
              <description>Divider IC2 Source Selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC3CFGR</name>
          <displayName>IC3CFGR</displayName>
          <description>RCC IC3 configuration register</description>
          <addressOffset>0xCC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IC3INT</name>
              <description>Divider IC3 integer division factor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC3SEL</name>
              <description>Divider IC3 Source Selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC4CFGR</name>
          <displayName>IC4CFGR</displayName>
          <description>RCC IC4 configuration register</description>
          <addressOffset>0xD0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IC4INT</name>
              <description>Divider IC4 integer division factor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC4SEL</name>
              <description>Divider IC4 Source Selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC5CFGR</name>
          <displayName>IC5CFGR</displayName>
          <description>RCC IC5 configuration register</description>
          <addressOffset>0xD4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IC5INT</name>
              <description>Divider IC5 integer division factor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC5SEL</name>
              <description>Divider IC5 Source Selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC6CFGR</name>
          <displayName>IC6CFGR</displayName>
          <description>RCC IC6 configuration register</description>
          <addressOffset>0xD8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00030000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IC6INT</name>
              <description>Divider IC6 integer division factor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC6SEL</name>
              <description>Divider IC6 Source Selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC7CFGR</name>
          <displayName>IC7CFGR</displayName>
          <description>RCC IC7 configuration register</description>
          <addressOffset>0xDC</addressOffset>
          <size>0x20</size>
          <resetValue>0x10000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IC7INT</name>
              <description>Divider IC7 integer division factor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC7SEL</name>
              <description>Divider IC7 Source Selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC8CFGR</name>
          <displayName>IC8CFGR</displayName>
          <description>RCC IC8 configuration register</description>
          <addressOffset>0xE0</addressOffset>
          <size>0x20</size>
          <resetValue>0x10000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IC8INT</name>
              <description>Divider IC8 integer division factor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC8SEL</name>
              <description>Divider IC8 Source Selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC9CFGR</name>
          <displayName>IC9CFGR</displayName>
          <description>RCC IC9 configuration register</description>
          <addressOffset>0xE4</addressOffset>
          <size>0x20</size>
          <resetValue>0x10000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IC9INT</name>
              <description>Divider IC9 integer division factor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC9SEL</name>
              <description>Divider IC9 Source Selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC10CFGR</name>
          <displayName>IC10CFGR</displayName>
          <description>RCC IC10 configuration register</description>
          <addressOffset>0xE8</addressOffset>
          <size>0x20</size>
          <resetValue>0x10000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IC10INT</name>
              <description>Divider IC10 integer division factor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC10SEL</name>
              <description>Divider IC10 Source Selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC11CFGR</name>
          <displayName>IC11CFGR</displayName>
          <description>RCC IC11 configuration register</description>
          <addressOffset>0xEC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00030000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IC11INT</name>
              <description>Divider IC11 integer division factor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC11SEL</name>
              <description>Divider IC11 Source Selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC12CFGR</name>
          <displayName>IC12CFGR</displayName>
          <description>RCC IC12 configuration register</description>
          <addressOffset>0xF0</addressOffset>
          <size>0x20</size>
          <resetValue>0x20000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IC12INT</name>
              <description>Divider IC12 integer division factor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC12SEL</name>
              <description>Divider IC12 Source Selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC13CFGR</name>
          <displayName>IC13CFGR</displayName>
          <description>RCC IC13 configuration register</description>
          <addressOffset>0xF4</addressOffset>
          <size>0x20</size>
          <resetValue>0x20000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IC13INT</name>
              <description>Divider IC13 integer division factor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC13SEL</name>
              <description>Divider IC13 Source Selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC14CFGR</name>
          <displayName>IC14CFGR</displayName>
          <description>RCC IC14 configuration register</description>
          <addressOffset>0xF8</addressOffset>
          <size>0x20</size>
          <resetValue>0x20000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IC14INT</name>
              <description>Divider IC14 integer division factor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC14SEL</name>
              <description>Divider IC14 Source Selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
