knieriem/tinygo-stm32-svd/svd/stm32n655.svd
        <register>
          <name>PRIVCFGR1</name>
          <displayName>PRIVCFGR1</displayName>
          <description>RCC PLL privilege configuration register1</description>
          <addressOffset>0x794</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLL1PV</name>
              <description>Defines the privilege protection of the PLL1 PLL configuration bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL2PV</name>
              <description>Defines the privilege protection of the PLL2 PLL configuration bits.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL3PV</name>
              <description>Defines the privilege protection of the PLL3 PLL configuration bits.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL4PV</name>
              <description>Defines the privilege protection of the PLL4 PLL configuration bits.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCKCFGR1</name>
          <displayName>LOCKCFGR1</displayName>
          <description>RCC PLL lock configuration register1</description>
          <addressOffset>0x798</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLL1LOCK</name>
              <description>Defines the lock protection of the PLL1 PLL configuration bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PLL2LOCK</name>
              <description>Defines the lock protection of the PLL2 PLL configuration bits.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PLL3LOCK</name>
              <description>Defines the lock protection of the PLL3 PLL configuration bits.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PLL4LOCK</name>
              <description>Defines the lock protection of the PLL4 PLL configuration bits.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBCFGR1</name>
          <displayName>PUBCFGR1</displayName>
          <description>RCC PLL public configuration register1</description>
          <addressOffset>0x79C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLL1PUB</name>
              <description>Defines the public protection of the PLL1 PLL configuration bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL2PUB</name>
              <description>Defines the public protection of the PLL2 PLL configuration bits.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL3PUB</name>
              <description>Defines the public protection of the PLL3 PLL configuration bits.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL4PUB</name>
              <description>Defines the public protection of the PLL4 PLL configuration bits.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SECCFGR2</name>
          <displayName>SECCFGR2</displayName>
          <description>RCC divider secure configuration register2</description>
          <addressOffset>0x7A0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IC1SEC</name>
              <description>Defines the secure protection of the IC1 divider configuration bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC2SEC</name>
              <description>Defines the secure protection of the IC2 divider configuration bits.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC3SEC</name>
              <description>Defines the secure protection of the IC3 divider configuration bits.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC4SEC</name>
              <description>Defines the secure protection of the IC4 divider configuration bits.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC5SEC</name>
              <description>Defines the secure protection of the IC5 divider configuration bits.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC6SEC</name>
              <description>Defines the secure protection of the IC6 divider configuration bits.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC7SEC</name>
              <description>Defines the secure protection of the IC7 divider configuration bits.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC8SEC</name>
              <description>Defines the secure protection of the IC8 divider configuration bits.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC9SEC</name>
              <description>Defines the secure protection of the IC9 divider configuration bits.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC10SEC</name>
              <description>Defines the secure protection of the IC10 divider configuration bits.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC11SEC</name>
              <description>Defines the secure protection of the IC11 divider configuration bits.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC12SEC</name>
              <description>Defines the secure protection of the IC12 divider configuration bits.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC13SEC</name>
              <description>Defines the secure protection of the IC13 divider configuration bits.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC14SEC</name>
              <description>Defines the secure protection of the IC14 divider configuration bits.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC15SEC</name>
              <description>Defines the secure protection of the IC15 divider configuration bits.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC16SEC</name>
              <description>Defines the secure protection of the IC16 divider configuration bits.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC17SEC</name>
              <description>Defines the secure protection of the IC17 divider configuration bits.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC18SEC</name>
              <description>Defines the secure protection of the IC18 divider configuration bits.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC19SEC</name>
              <description>Defines the secure protection of the IC19 divider configuration bits.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC20SEC</name>
              <description>Defines the secure protection of the IC20 divider configuration bits.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIVCFGR2</name>
          <displayName>PRIVCFGR2</displayName>
          <description>RCC divider privilege configuration register2</description>
          <addressOffset>0x7A4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IC1PV</name>
              <description>Defines the privilege protection of the IC1 divider configuration bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC2PV</name>
              <description>Defines the privilege protection of the IC2 divider configuration bits.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC3PV</name>
              <description>Defines the privilege protection of the IC3 divider configuration bits.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC4PV</name>
              <description>Defines the privilege protection of the IC4 divider configuration bits.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC5PV</name>
              <description>Defines the privilege protection of the IC5 divider configuration bits.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC6PV</name>
              <description>Defines the privilege protection of the IC6 divider configuration bits.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC7PV</name>
              <description>Defines the privilege protection of the IC7 divider configuration bits.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC8PV</name>
              <description>Defines the privilege protection of the IC8 divider configuration bits.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC9PV</name>
              <description>Defines the privilege protection of the IC9 divider configuration bits.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC10PV</name>
              <description>Defines the privilege protection of the IC10 divider configuration bits.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC11PV</name>
              <description>Defines the privilege protection of the IC11 divider configuration bits.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC12PV</name>
              <description>Defines the privilege protection of the IC12 divider configuration bits.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC13PV</name>
              <description>Defines the privilege protection of the IC13 divider configuration bits.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC14PV</name>
              <description>Defines the privilege protection of the IC14 divider configuration bits.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC15PV</name>
              <description>Defines the privilege protection of the IC15 divider configuration bits.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC16PV</name>
              <description>Defines the privilege protection of the IC16 divider configuration bits.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC17PV</name>
              <description>Defines the privilege protection of the IC17 divider configuration bits.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC18PV</name>
              <description>Defines the privilege protection of the IC18 divider configuration bits.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC19PV</name>
              <description>Defines the privilege protection of the IC19 divider configuration bits.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC20PV</name>
              <description>Defines the privilege protection of the IC20 divider configuration bits.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
