knieriem/tinygo-stm32-svd/svd/stm32n655.svd
        <register>
          <name>PRIVCFGCR2</name>
          <displayName>PRIVCFGCR2</displayName>
          <description>RCC divider privilege configuration register2</description>
          <addressOffset>0x17A4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IC1PVC</name>
              <description>Defines the privilege protection of the IC1 configuration bits (enable, ready, divider).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC2PVC</name>
              <description>Defines the privilege protection of the IC2 configuration bits (enable, ready, divider).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC3PVC</name>
              <description>Defines the privilege protection of the IC3 configuration bits (enable, ready, divider).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC4PVC</name>
              <description>Defines the privilege protection of the IC4 configuration bits (enable, ready, divider).</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC5PVC</name>
              <description>Defines the privilege protection of the IC5 configuration bits (enable, ready, divider).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC6PVC</name>
              <description>Defines the privilege protection of the IC6 configuration bits (enable, ready, divider).</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC7PVC</name>
              <description>Defines the privilege protection of the IC7 configuration bits (enable, ready, divider).</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC8PVC</name>
              <description>Defines the privilege protection of the IC8 configuration bits (enable, ready, divider).</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC9PVC</name>
              <description>Defines the privilege protection of the IC9 configuration bits (enable, ready, divider).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC10PVC</name>
              <description>Defines the privilege protection of the IC10 configuration bits (enable, ready, divider).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC11PVC</name>
              <description>Defines the privilege protection of the IC11 configuration bits (enable, ready, divider).</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC12PVC</name>
              <description>Defines the privilege protection of the IC12 configuration bits (enable, ready, divider).</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC13PVC</name>
              <description>Defines the privilege protection of the IC13 configuration bits (enable, ready, divider).</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC14PVC</name>
              <description>Defines the privilege protection of the IC14 configuration bits (enable, ready, divider).</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC15PVC</name>
              <description>Defines the privilege protection of the IC15 configuration bits (enable, ready, divider).</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC16PVC</name>
              <description>Defines the privilege protection of the IC16 configuration bits (enable, ready, divider).</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC17PVC</name>
              <description>Defines the privilege protection of the IC17 configuration bits (enable, ready, divider).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC18PVC</name>
              <description>Defines the privilege protection of the IC18 configuration bits (enable, ready, divider).</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC19PVC</name>
              <description>Defines the privilege protection of the IC19 configuration bits (enable, ready, divider).</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC20PVC</name>
              <description>Defines the privilege protection of the IC20 configuration bits (enable, ready, divider).</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBCFGCR2</name>
          <displayName>PUBCFGCR2</displayName>
          <description>RCC divider public configuration register2</description>
          <addressOffset>0x17AC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IC1PUBC</name>
              <description>Defines the public protection of the IC1 configuration bits (enable, ready, divider).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC2PUBC</name>
              <description>Defines the public protection of the IC2 configuration bits (enable, ready, divider).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC3PUBC</name>
              <description>Defines the public protection of the IC3 configuration bits (enable, ready, divider).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC4PUBC</name>
              <description>Defines the public protection of the IC4 configuration bits (enable, ready, divider).</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC5PUBC</name>
              <description>Defines the public protection of the IC5 configuration bits (enable, ready, divider).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC6PUBC</name>
              <description>Defines the public protection of the IC6 configuration bits (enable, ready, divider).</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC7PUBC</name>
              <description>Defines the public protection of the IC7 configuration bits (enable, ready, divider).</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC8PUBC</name>
              <description>Defines the public protection of the IC8 configuration bits (enable, ready, divider).</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC9PUBC</name>
              <description>Defines the public protection of the IC9 configuration bits (enable, ready, divider).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC10PUBC</name>
              <description>Defines the public protection of the IC10 configuration bits (enable, ready, divider).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC11PUBC</name>
              <description>Defines the public protection of the IC11 configuration bits (enable, ready, divider).</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC12PUBC</name>
              <description>Defines the public protection of the IC12 configuration bits (enable, ready, divider).</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC13PUBC</name>
              <description>Defines the public protection of the IC13 configuration bits (enable, ready, divider).</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC14PUBC</name>
              <description>Defines the public protection of the IC14 configuration bits (enable, ready, divider).</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC15PUBC</name>
              <description>Defines the public protection of the IC15 configuration bits (enable, ready, divider).</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC16PUBC</name>
              <description>Defines the public protection of the IC16 configuration bits (enable, ready, divider).</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC17PUBC</name>
              <description>Defines the public protection of the IC17 configuration bits (enable, ready, divider).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC18PUBC</name>
              <description>Defines the public protection of the IC18 configuration bits (enable, ready, divider).</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC19PUBC</name>
              <description>Defines the public protection of the IC19 configuration bits (enable, ready, divider).</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC20PUBC</name>
              <description>Defines the public protection of the IC20 configuration bits (enable, ready, divider).</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIVCFGCR3</name>
          <displayName>PRIVCFGCR3</displayName>
          <description>RCC system privilege configuration register3</description>
          <addressOffset>0x17B4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MODPVC</name>
              <description>Defines the privilege protection of the MOD configuration bits (enable, ready, divider).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SYSPVC</name>
              <description>Defines the privilege protection of the SYS configuration bits (enable, ready, divider).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BUSPVC</name>
              <description>Defines the privilege protection of the BUS configuration bits (enable, ready, divider).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PERPVC</name>
              <description>Defines the privilege protection of the PER configuration bits (enable, ready, divider).</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INTPVC</name>
              <description>Defines the privilege protection of the INT configuration bits (enable, ready, divider).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RSTPVC</name>
              <description>Defines the privilege protection of the RST configuration bits (enable, ready, divider).</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DFTPVC</name>
              <description>Defines the privilege protection of the DFT configuration bits (enable, ready, divider).</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBCFGCR3</name>
          <displayName>PUBCFGCR3</displayName>
          <description>RCC system public configuration register3</description>
          <addressOffset>0x17BC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MODPUBC</name>
              <description>Defines the public protection of the MOD configuration bits (enable, ready, divider).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SYSPUBC</name>
              <description>Defines the public protection of the SYS configuration bits (enable, ready, divider).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BUSPUBC</name>
              <description>Defines the public protection of the BUS configuration bits (enable, ready, divider).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PERPUBC</name>
              <description>Defines the public protection of the PER configuration bits (enable, ready, divider).</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INTPUBC</name>
              <description>Defines the public protection of the INT configuration bits (enable, ready, divider).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RSTPUBC</name>
              <description>Defines the public protection of the RST configuration bits (enable, ready, divider).</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DFTPUBC</name>
              <description>Defines the public protection of the DFT configuration bits (enable, ready, divider).</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
